app/controllers/landings_controller.rb

SELECT "landings".* FROM "landings"
---
  def index
    @landings = Landing.all

INSERT INTO "landings" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 08 Dec 2013 20:15:20 UTC +00:00], ["updated_at", Sun, 08 Dec 2013 20:15:20 UTC +00:00]]
---
  def create
    @landing = Landing.new(landing_params)

    respond_to do |format|
      if @landing.save

SELECT "landings".* FROM "landings" WHERE "landings"."id" = ? LIMIT 1  [["id", "show"]]
---
    def set_landing
      @landing = Landing.find(params[:id])